Notas-de-clase/clase-2022-08-19.md

# &Iacute;ndice

1.  [Java](#org677ce05)
    1.  [Otros operadores](#orgf5daf9c)
    2.  [Operadores lógicos](#org298e537)
    3.  [Estructuras de control](#org4a619ec)



<a id="org677ce05"></a>

# Java


<a id="orgf5daf9c"></a>

## Otros operadores

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">=</td>
<td class="org-left">Asignación</td>
</tr>


<tr>
<td class="org-left">+=</td>
<td class="org-left">Suma y asignación</td>
</tr>


<tr>
<td class="org-left">-=</td>
<td class="org-left">Resta y asignación</td>
</tr>


<tr>
<td class="org-left">*=</td>
<td class="org-left">Multiplicación y asignación</td>
</tr>


<tr>
<td class="org-left">/=</td>
<td class="org-left">División y asignación</td>
</tr>


<tr>
<td class="org-left">%=</td>
<td class="org-left">Módulo y asignación</td>
</tr>


<tr>
<td class="org-left">==</td>
<td class="org-left">Igual que</td>
</tr>


<tr>
<td class="org-left">!=</td>
<td class="org-left">Diferente que</td>
</tr>


<tr>
<td class="org-left">&vert;</td>
<td class="org-left">OR bitwise</td>
</tr>


<tr>
<td class="org-left">^</td>
<td class="org-left">XOR  bitwise</td>
</tr>


<tr>
<td class="org-left">&amp;</td>
<td class="org-left">AND bitwise</td>
</tr>


<tr>
<td class="org-left">&gt;&gt;</td>
<td class="org-left">Desplazamiento derecha</td>
</tr>


<tr>
<td class="org-left">&lt;&lt;</td>
<td class="org-left">Desplazamiento izquierda</td>
</tr>


<tr>
<td class="org-left">&vert;def=</td>
<td class="org-left">OR bitwise y asignación</td>
</tr>


<tr>
<td class="org-left">&amp;=</td>
<td class="org-left">AND bitwise y asignación</td>
</tr>


<tr>
<td class="org-left">^=</td>
<td class="org-left">XOR bitwise y asignación</td>
</tr>


<tr>
<td class="org-left">&gt;&gt;=</td>
<td class="org-left">Desplazamiento derecha y asignación</td>
</tr>


<tr>
<td class="org-left">&lt;&lt;=</td>
<td class="org-left">Desplazamiento izquierda y asignación</td>
</tr>
</tbody>
</table>


<a id="org298e537"></a>

## Operadores lógicos

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">&amp;&amp;</td>
<td class="org-left">And</td>
</tr>


<tr>
<td class="org-left">&vert;def&vert;def</td>
<td class="org-left">Or</td>
</tr>


<tr>
<td class="org-left">!</td>
<td class="org-left">Not</td>
</tr>
</tbody>
</table>


<a id="org4a619ec"></a>

## Estructuras de control

Emiten al programador especificar si qla siguiente intruccipon a ejecutarse tal vez no sea la siguiente en la secuencia.

